Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_twim.h
/* -------- TWIM_CMDR : (TWIM Offset: 0x0C) (R/W 32) Command Register -------- */
#define TWIM_CMDR_OFFSET            0x0C         /**< \brief (TWIM_CMDR offset) Command Register */
#define TWIM_CMDR_RESETVALUE        0x00000000   /**< \brief (TWIM_CMDR reset_value) Command Register */

#define TWIM_CMDR_READ_Pos          0            /**< \brief (TWIM_CMDR) Transfer Direction */
#define TWIM_CMDR_READ              (0x1u << TWIM_CMDR_READ_Pos)
#define TWIM_CMDR_SADR_Pos          1            /**< \brief (TWIM_CMDR) Slave Address */
#define TWIM_CMDR_SADR_Msk          (0x3FFu << TWIM_CMDR_SADR_Pos)
#define TWIM_CMDR_SADR(value)       ((TWIM_CMDR_SADR_Msk & ((value) << TWIM_CMDR_SADR_Pos)))
#define TWIM_CMDR_TENBIT_Pos        11           /**< \brief (TWIM_CMDR) Ten Bit Addressing Mode */
#define TWIM_CMDR_TENBIT            (0x1u << TWIM_CMDR_TENBIT_Pos)
#define TWIM_CMDR_REPSAME_Pos       12           /**< \brief (TWIM_CMDR) Transfer is to same address as previous address */
#define TWIM_CMDR_REPSAME           (0x1u << TWIM_CMDR_REPSAME_Pos)
#define TWIM_CMDR_START_Pos         13           /**< \brief (TWIM_CMDR) Send START condition */
#define TWIM_CMDR_START             (0x1u << TWIM_CMDR_START_Pos)
#define TWIM_CMDR_STOP_Pos          14           /**< \brief (TWIM_CMDR) Send STOP condition */
#define TWIM_CMDR_STOP              (0x1u << TWIM_CMDR_STOP_Pos)
#define TWIM_CMDR_VALID_Pos         15           /**< \brief (TWIM_CMDR) CMDR Valid */
#define TWIM_CMDR_VALID             (0x1u << TWIM_CMDR_VALID_Pos)
#define TWIM_CMDR_NBYTES_Pos        16           /**< \brief (TWIM_CMDR) Number of data bytes in transfer */
#define TWIM_CMDR_NBYTES_Msk        (0xFFu << TWIM_CMDR_NBYTES_Pos)
#define TWIM_CMDR_NBYTES(value)     ((TWIM_CMDR_NBYTES_Msk & ((value) << TWIM_CMDR_NBYTES_Pos)))
#define TWIM_CMDR_PECEN_Pos         24           /**< \brief (TWIM_CMDR) Packet Error Checking Enable */
#define TWIM_CMDR_PECEN             (0x1u << TWIM_CMDR_PECEN_Pos)
#define TWIM_CMDR_ACKLAST_Pos       25           /**< \brief (TWIM_CMDR) ACK Last Master RX Byte */
#define TWIM_CMDR_ACKLAST           (0x1u << TWIM_CMDR_ACKLAST_Pos)
#define TWIM_CMDR_HS_Pos            26           /**< \brief (TWIM_CMDR) HS-mode */
#define TWIM_CMDR_HS                (0x1u << TWIM_CMDR_HS_Pos)
#define TWIM_CMDR_HSMCODE_Pos       28           /**< \brief (TWIM_CMDR) HS-mode Master Code */
#define TWIM_CMDR_HSMCODE_Msk       (0x7u << TWIM_CMDR_HSMCODE_Pos)
#define TWIM_CMDR_HSMCODE(value)    ((TWIM_CMDR_HSMCODE_Msk & ((value) << TWIM_CMDR_HSMCODE_Pos)))
#define TWIM_CMDR_MASK              0x77FFFFFFu  /**< \brief (TWIM_CMDR) MASK Register */

/* -------- TWIM_NCMDR : (TWIM Offset: 0x10) (R/W 32) Next Command Register -------- */
#define TWIM_NCMDR_OFFSET           0x10         /**< \brief (TWIM_NCMDR offset) Next Command Register */
#define TWIM_NCMDR_RESETVALUE       0x00000000   /**< \brief (TWIM_NCMDR reset_value) Next Command Register */

#define TWIM_NCMDR_READ_Pos         0            /**< \brief (TWIM_NCMDR) Transfer Direction */
#define TWIM_NCMDR_READ             (0x1u << TWIM_NCMDR_READ_Pos)
#define TWIM_NCMDR_SADR_Pos         1            /**< \brief (TWIM_NCMDR) Slave Address */
#define TWIM_NCMDR_SADR_Msk         (0x3FFu << TWIM_NCMDR_SADR_Pos)
#define TWIM_NCMDR_SADR(value)      ((TWIM_NCMDR_SADR_Msk & ((value) << TWIM_NCMDR_SADR_Pos)))
#define TWIM_NCMDR_TENBIT_Pos       11           /**< \brief (TWIM_NCMDR) Ten Bit Addressing Mode */
#define TWIM_NCMDR_TENBIT           (0x1u << TWIM_NCMDR_TENBIT_Pos)
#define TWIM_NCMDR_REPSAME_Pos      12           /**< \brief (TWIM_NCMDR) Transfer is to same address as previous address */
#define TWIM_NCMDR_REPSAME          (0x1u << TWIM_NCMDR_REPSAME_Pos)
#define TWIM_NCMDR_START_Pos        13           /**< \brief (TWIM_NCMDR) Send START condition */
#define TWIM_NCMDR_START            (0x1u << TWIM_NCMDR_START_Pos)
#define TWIM_NCMDR_STOP_Pos         14           /**< \brief (TWIM_NCMDR) Send STOP condition */
#define TWIM_NCMDR_STOP             (0x1u << TWIM_NCMDR_STOP_Pos)
#define TWIM_NCMDR_VALID_Pos        15           /**< \brief (TWIM_NCMDR) CMDR Valid */
#define TWIM_NCMDR_VALID            (0x1u << TWIM_NCMDR_VALID_Pos)
#define TWIM_NCMDR_NBYTES_Pos       16           /**< \brief (TWIM_NCMDR) Number of data bytes in transfer */
#define TWIM_NCMDR_NBYTES_Msk       (0xFFu << TWIM_NCMDR_NBYTES_Pos)
#define TWIM_NCMDR_NBYTES(value)    ((TWIM_NCMDR_NBYTES_Msk & ((value) << TWIM_NCMDR_NBYTES_Pos)))
#define TWIM_NCMDR_PECEN_Pos        24           /**< \brief (TWIM_NCMDR) Packet Error Checking Enable */
#define TWIM_NCMDR_PECEN            (0x1u << TWIM_NCMDR_PECEN_Pos)
#define TWIM_NCMDR_ACKLAST_Pos      25           /**< \brief (TWIM_NCMDR) ACK Last Master RX Byte */
#define TWIM_NCMDR_ACKLAST          (0x1u << TWIM_NCMDR_ACKLAST_Pos)
#define TWIM_NCMDR_HS_Pos           26           /**< \brief (TWIM_NCMDR) HS-mode */
#define TWIM_NCMDR_HS               (0x1u << TWIM_NCMDR_HS_Pos)
#define TWIM_NCMDR_HSMCODE_Pos      28           /**< \brief (TWIM_NCMDR) HS-mode Master Code */
#define TWIM_NCMDR_HSMCODE_Msk      (0x7u << TWIM_NCMDR_HSMCODE_Pos)
#define TWIM_NCMDR_HSMCODE(value)   ((TWIM_NCMDR_HSMCODE_Msk & ((value) << TWIM_NCMDR_HSMCODE_Pos)))
#define TWIM_NCMDR_MASK             0x77FFFFFFu  /**< \brief (TWIM_NCMDR) MASK Register */

/* -------- TWIM_RHR : (TWIM Offset: 0x14) (R/  32) Receive Holding Register -------- */
#define TWIM_RHR_OFFSET             0x14         /**< \brief (TWIM_RHR offset) Receive Holding Register */
#define TWIM_RHR_RESETVALUE         0x00000000   /**< \brief (TWIM_RHR reset_value) Receive Holding Register */

#define TWIM_RHR_RXDATA_Pos         0            /**< \brief (TWIM_RHR) Received Data */
#define TWIM_RHR_RXDATA_Msk         (0xFFu << TWIM_RHR_RXDATA_Pos)
#define TWIM_RHR_RXDATA(value)      ((TWIM_RHR_RXDATA_Msk & ((value) << TWIM_RHR_RXDATA_Pos)))
#define TWIM_RHR_MASK               0x000000FFu  /**< \brief (TWIM_RHR) MASK Register */

/* -------- TWIM_THR : (TWIM Offset: 0x18) ( /W 32) Transmit Holding Register -------- */
#define TWIM_THR_OFFSET             0x18         /**< \brief (TWIM_THR offset) Transmit Holding Register */
#define TWIM_THR_RESETVALUE         0x00000000   /**< \brief (TWIM_THR reset_value) Transmit Holding Register */

#define TWIM_THR_TXDATA_Pos         0            /**< \brief (TWIM_THR) Data to Transmit */
#define TWIM_THR_TXDATA_Msk         (0xFFu << TWIM_THR_TXDATA_Pos)
#define TWIM_THR_TXDATA(value)      ((TWIM_THR_TXDATA_Msk & ((value) << TWIM_THR_TXDATA_Pos)))
#define TWIM_THR_MASK               0x000000FFu  /**< \brief (TWIM_THR) MASK Register */

/* -------- TWIM_SR : (TWIM Offset: 0x1C) (R/  32) Status Register -------- */
#define TWIM_SR_OFFSET              0x1C         /**< \brief (TWIM_SR offset) Status Register */
#define TWIM_SR_RESETVALUE          0x00000002   /**< \brief (TWIM_SR reset_value) Status Register */

#define TWIM_SR_RXRDY_Pos           0            /**< \brief (TWIM_SR) RHR Data Ready */
#define TWIM_SR_RXRDY               (0x1u << TWIM_SR_RXRDY_Pos)
#define TWIM_SR_TXRDY_Pos           1            /**< \brief (TWIM_SR) THR Data Ready */
#define TWIM_SR_TXRDY               (0x1u << TWIM_SR_TXRDY_Pos)
#define TWIM_SR_CRDY_Pos            2            /**< \brief (TWIM_SR) Ready for More Commands */
#define TWIM_SR_CRDY                (0x1u << TWIM_SR_CRDY_Pos)
#define TWIM_SR_CCOMP_Pos           3            /**< \brief (TWIM_SR) Command Complete */
#define TWIM_SR_CCOMP               (0x1u << TWIM_SR_CCOMP_Pos)
#define TWIM_SR_IDLE_Pos            4            /**< \brief (TWIM_SR) Master Interface is Idle */
#define TWIM_SR_IDLE                (0x1u << TWIM_SR_IDLE_Pos)
#define TWIM_SR_BUSFREE_Pos         5            /**< \brief (TWIM_SR) Two-wire Bus is Free */
#define TWIM_SR_BUSFREE             (0x1u << TWIM_SR_BUSFREE_Pos)
#define TWIM_SR_ANAK_Pos            8            /**< \brief (TWIM_SR) NAK in Address Phase Received */
#define TWIM_SR_ANAK                (0x1u << TWIM_SR_ANAK_Pos)
#define TWIM_SR_DNAK_Pos            9            /**< \brief (TWIM_SR) NAK in Data Phase Received */
#define TWIM_SR_DNAK                (0x1u << TWIM_SR_DNAK_Pos)
#define TWIM_SR_ARBLST_Pos          10           /**< \brief (TWIM_SR) Arbitration Lost */
#define TWIM_SR_ARBLST              (0x1u << TWIM_SR_ARBLST_Pos)
#define TWIM_SR_SMBALERT_Pos        11           /**< \brief (TWIM_SR) SMBus Alert */
#define TWIM_SR_SMBALERT            (0x1u << TWIM_SR_SMBALERT_Pos)
#define TWIM_SR_TOUT_Pos            12           /**< \brief (TWIM_SR) Timeout */
#define TWIM_SR_TOUT                (0x1u << TWIM_SR_TOUT_Pos)
#define TWIM_SR_PECERR_Pos          13           /**< \brief (TWIM_SR) PEC Error */
#define TWIM_SR_PECERR              (0x1u << TWIM_SR_PECERR_Pos)
#define TWIM_SR_STOP_Pos            14           /**< \brief (TWIM_SR) Stop Request Accepted */
#define TWIM_SR_STOP                (0x1u << TWIM_SR_STOP_Pos)
#define TWIM_SR_MENB_Pos            16           /**< \brief (TWIM_SR) Master Interface Enable */
#define TWIM_SR_MENB                (0x1u << TWIM_SR_MENB_Pos)
#define TWIM_SR_HSMCACK_Pos         17           /**< \brief (TWIM_SR) ACK in HS-mode Master Code Phase Received */
#define TWIM_SR_HSMCACK             (0x1u << TWIM_SR_HSMCACK_Pos)
#define TWIM_SR_MASK                0x00037F3Fu  /**< \brief (TWIM_SR) MASK Register */

/* -------- TWIM_IER : (TWIM Offset: 0x20) ( /W 32) Interrupt Enable Register -------- */
#define TWIM_IER_OFFSET             0x20         /**< \brief (TWIM_IER offset) Interrupt Enable Register */
#define TWIM_IER_RESETVALUE         0x00000000   /**< \brief (TWIM_IER reset_value) Interrupt Enable Register */

#define TWIM_IER_RXRDY_Pos          0            /**< \brief (TWIM_IER) RHR Data Ready */
#define TWIM_IER_RXRDY              (0x1u << TWIM_IER_RXRDY_Pos)
#define TWIM_IER_TXRDY_Pos          1            /**< \brief (TWIM_IER) THR Data Ready */
#define TWIM_IER_TXRDY              (0x1u << TWIM_IER_TXRDY_Pos)
#define TWIM_IER_CRDY_Pos           2            /**< \brief (TWIM_IER) Ready for More Commands */
#define TWIM_IER_CRDY               (0x1u << TWIM_IER_CRDY_Pos)
#define TWIM_IER_CCOMP_Pos          3            /**< \brief (TWIM_IER) Command Complete */
#define TWIM_IER_CCOMP              (0x1u << TWIM_IER_CCOMP_Pos)
#define TWIM_IER_IDLE_Pos           4            /**< \brief (TWIM_IER) Master Interface is Idle */
#define TWIM_IER_IDLE               (0x1u << TWIM_IER_IDLE_Pos)
#define TWIM_IER_BUSFREE_Pos        5            /**< \brief (TWIM_IER) Two-wire Bus is Free */
#define TWIM_IER_BUSFREE            (0x1u << TWIM_IER_BUSFREE_Pos)
#define TWIM_IER_ANAK_Pos           8            /**< \brief (TWIM_IER) NAK in Address Phase Received */
#define TWIM_IER_ANAK               (0x1u << TWIM_IER_ANAK_Pos)
#define TWIM_IER_DNAK_Pos           9            /**< \brief (TWIM_IER) NAK in Data Phase Received */
#define TWIM_IER_DNAK               (0x1u << TWIM_IER_DNAK_Pos)
#define TWIM_IER_ARBLST_Pos         10           /**< \brief (TWIM_IER) Arbitration Lost */
#define TWIM_IER_ARBLST             (0x1u << TWIM_IER_ARBLST_Pos)
#define TWIM_IER_SMBALERT_Pos       11           /**< \brief (TWIM_IER) SMBus Alert */
#define TWIM_IER_SMBALERT           (0x1u << TWIM_IER_SMBALERT_Pos)
#define TWIM_IER_TOUT_Pos           12           /**< \brief (TWIM_IER) Timeout */
#define TWIM_IER_TOUT               (0x1u << TWIM_IER_TOUT_Pos)
#define TWIM_IER_PECERR_Pos         13           /**< \brief (TWIM_IER) PEC Error */
#define TWIM_IER_PECERR             (0x1u << TWIM_IER_PECERR_Pos)
#define TWIM_IER_STOP_Pos           14           /**< \brief (TWIM_IER) Stop Request Accepted */
#define TWIM_IER_STOP               (0x1u << TWIM_IER_STOP_Pos)
#define TWIM_IER_HSMCACK_Pos        17           /**< \brief (TWIM_IER) ACK in HS-mode Master Code Phase Received */
#define TWIM_IER_HSMCACK            (0x1u << TWIM_IER_HSMCACK_Pos)
#define TWIM_IER_MASK               0x00027F3Fu  /**< \brief (TWIM_IER) MASK Register */

