Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_twim.h
/* -------- TWIM_IDR : (TWIM Offset: 0x24) ( /W 32) Interrupt Disable Register -------- */
#define TWIM_IDR_OFFSET             0x24         /**< \brief (TWIM_IDR offset) Interrupt Disable Register */
#define TWIM_IDR_RESETVALUE         0x00000000   /**< \brief (TWIM_IDR reset_value) Interrupt Disable Register */

#define TWIM_IDR_RXRDY_Pos          0            /**< \brief (TWIM_IDR) RHR Data Ready */
#define TWIM_IDR_RXRDY              (0x1u << TWIM_IDR_RXRDY_Pos)
#define TWIM_IDR_TXRDY_Pos          1            /**< \brief (TWIM_IDR) THR Data Ready */
#define TWIM_IDR_TXRDY              (0x1u << TWIM_IDR_TXRDY_Pos)
#define TWIM_IDR_CRDY_Pos           2            /**< \brief (TWIM_IDR) Ready for More Commands */
#define TWIM_IDR_CRDY               (0x1u << TWIM_IDR_CRDY_Pos)
#define TWIM_IDR_CCOMP_Pos          3            /**< \brief (TWIM_IDR) Command Complete */
#define TWIM_IDR_CCOMP              (0x1u << TWIM_IDR_CCOMP_Pos)
#define TWIM_IDR_IDLE_Pos           4            /**< \brief (TWIM_IDR) Master Interface is Idle */
#define TWIM_IDR_IDLE               (0x1u << TWIM_IDR_IDLE_Pos)
#define TWIM_IDR_BUSFREE_Pos        5            /**< \brief (TWIM_IDR) Two-wire Bus is Free */
#define TWIM_IDR_BUSFREE            (0x1u << TWIM_IDR_BUSFREE_Pos)
#define TWIM_IDR_ANAK_Pos           8            /**< \brief (TWIM_IDR) NAK in Address Phase Received */
#define TWIM_IDR_ANAK               (0x1u << TWIM_IDR_ANAK_Pos)
#define TWIM_IDR_DNAK_Pos           9            /**< \brief (TWIM_IDR) NAK in Data Phase Received */
#define TWIM_IDR_DNAK               (0x1u << TWIM_IDR_DNAK_Pos)
#define TWIM_IDR_ARBLST_Pos         10           /**< \brief (TWIM_IDR) Arbitration Lost */
#define TWIM_IDR_ARBLST             (0x1u << TWIM_IDR_ARBLST_Pos)
#define TWIM_IDR_SMBALERT_Pos       11           /**< \brief (TWIM_IDR) SMBus Alert */
#define TWIM_IDR_SMBALERT           (0x1u << TWIM_IDR_SMBALERT_Pos)
#define TWIM_IDR_TOUT_Pos           12           /**< \brief (TWIM_IDR) Timeout */
#define TWIM_IDR_TOUT               (0x1u << TWIM_IDR_TOUT_Pos)
#define TWIM_IDR_PECERR_Pos         13           /**< \brief (TWIM_IDR) PEC Error */
#define TWIM_IDR_PECERR             (0x1u << TWIM_IDR_PECERR_Pos)
#define TWIM_IDR_STOP_Pos           14           /**< \brief (TWIM_IDR) Stop Request Accepted */
#define TWIM_IDR_STOP               (0x1u << TWIM_IDR_STOP_Pos)
#define TWIM_IDR_HSMCACK_Pos        17           /**< \brief (TWIM_IDR) ACK in HS-mode Master Code Phase Received */
#define TWIM_IDR_HSMCACK            (0x1u << TWIM_IDR_HSMCACK_Pos)
#define TWIM_IDR_MASK               0x00027F3Fu  /**< \brief (TWIM_IDR) MASK Register */

/* -------- TWIM_IMR : (TWIM Offset: 0x28) (R/  32) Interrupt Mask Register -------- */
#define TWIM_IMR_OFFSET             0x28         /**< \brief (TWIM_IMR offset) Interrupt Mask Register */
#define TWIM_IMR_RESETVALUE         0x00000000   /**< \brief (TWIM_IMR reset_value) Interrupt Mask Register */

#define TWIM_IMR_RXRDY_Pos          0            /**< \brief (TWIM_IMR) RHR Data Ready */
#define TWIM_IMR_RXRDY              (0x1u << TWIM_IMR_RXRDY_Pos)
#define TWIM_IMR_TXRDY_Pos          1            /**< \brief (TWIM_IMR) THR Data Ready */
#define TWIM_IMR_TXRDY              (0x1u << TWIM_IMR_TXRDY_Pos)
#define TWIM_IMR_CRDY_Pos           2            /**< \brief (TWIM_IMR) Ready for More Commands */
#define TWIM_IMR_CRDY               (0x1u << TWIM_IMR_CRDY_Pos)
#define TWIM_IMR_CCOMP_Pos          3            /**< \brief (TWIM_IMR) Command Complete */
#define TWIM_IMR_CCOMP              (0x1u << TWIM_IMR_CCOMP_Pos)
#define TWIM_IMR_IDLE_Pos           4            /**< \brief (TWIM_IMR) Master Interface is Idle */
#define TWIM_IMR_IDLE               (0x1u << TWIM_IMR_IDLE_Pos)
#define TWIM_IMR_BUSFREE_Pos        5            /**< \brief (TWIM_IMR) Two-wire Bus is Free */
#define TWIM_IMR_BUSFREE            (0x1u << TWIM_IMR_BUSFREE_Pos)
#define TWIM_IMR_ANAK_Pos           8            /**< \brief (TWIM_IMR) NAK in Address Phase Received */
#define TWIM_IMR_ANAK               (0x1u << TWIM_IMR_ANAK_Pos)
#define TWIM_IMR_DNAK_Pos           9            /**< \brief (TWIM_IMR) NAK in Data Phase Received */
#define TWIM_IMR_DNAK               (0x1u << TWIM_IMR_DNAK_Pos)
#define TWIM_IMR_ARBLST_Pos         10           /**< \brief (TWIM_IMR) Arbitration Lost */
#define TWIM_IMR_ARBLST             (0x1u << TWIM_IMR_ARBLST_Pos)
#define TWIM_IMR_SMBALERT_Pos       11           /**< \brief (TWIM_IMR) SMBus Alert */
#define TWIM_IMR_SMBALERT           (0x1u << TWIM_IMR_SMBALERT_Pos)
#define TWIM_IMR_TOUT_Pos           12           /**< \brief (TWIM_IMR) Timeout */
#define TWIM_IMR_TOUT               (0x1u << TWIM_IMR_TOUT_Pos)
#define TWIM_IMR_PECERR_Pos         13           /**< \brief (TWIM_IMR) PEC Error */
#define TWIM_IMR_PECERR             (0x1u << TWIM_IMR_PECERR_Pos)
#define TWIM_IMR_STOP_Pos           14           /**< \brief (TWIM_IMR) Stop Request Accepted */
#define TWIM_IMR_STOP               (0x1u << TWIM_IMR_STOP_Pos)
#define TWIM_IMR_HSMCACK_Pos        17           /**< \brief (TWIM_IMR) ACK in HS-mode Master Code Phase Received */
#define TWIM_IMR_HSMCACK            (0x1u << TWIM_IMR_HSMCACK_Pos)
#define TWIM_IMR_MASK               0x00027F3Fu  /**< \brief (TWIM_IMR) MASK Register */

/* -------- TWIM_SCR : (TWIM Offset: 0x2C) ( /W 32) Status Clear Register -------- */
#define TWIM_SCR_OFFSET             0x2C         /**< \brief (TWIM_SCR offset) Status Clear Register */
#define TWIM_SCR_RESETVALUE         0x00000000   /**< \brief (TWIM_SCR reset_value) Status Clear Register */

#define TWIM_SCR_CCOMP_Pos          3            /**< \brief (TWIM_SCR) Command Complete */
#define TWIM_SCR_CCOMP              (0x1u << TWIM_SCR_CCOMP_Pos)
#define TWIM_SCR_ANAK_Pos           8            /**< \brief (TWIM_SCR) NAK in Address Phase Received */
#define TWIM_SCR_ANAK               (0x1u << TWIM_SCR_ANAK_Pos)
#define TWIM_SCR_DNAK_Pos           9            /**< \brief (TWIM_SCR) NAK in Data Phase Received */
#define TWIM_SCR_DNAK               (0x1u << TWIM_SCR_DNAK_Pos)
#define TWIM_SCR_ARBLST_Pos         10           /**< \brief (TWIM_SCR) Arbitration Lost */
#define TWIM_SCR_ARBLST             (0x1u << TWIM_SCR_ARBLST_Pos)
#define TWIM_SCR_SMBALERT_Pos       11           /**< \brief (TWIM_SCR) SMBus Alert */
#define TWIM_SCR_SMBALERT           (0x1u << TWIM_SCR_SMBALERT_Pos)
#define TWIM_SCR_TOUT_Pos           12           /**< \brief (TWIM_SCR) Timeout */
#define TWIM_SCR_TOUT               (0x1u << TWIM_SCR_TOUT_Pos)
#define TWIM_SCR_PECERR_Pos         13           /**< \brief (TWIM_SCR) PEC Error */
#define TWIM_SCR_PECERR             (0x1u << TWIM_SCR_PECERR_Pos)
#define TWIM_SCR_STOP_Pos           14           /**< \brief (TWIM_SCR) Stop Request Accepted */
#define TWIM_SCR_STOP               (0x1u << TWIM_SCR_STOP_Pos)
#define TWIM_SCR_HSMCACK_Pos        17           /**< \brief (TWIM_SCR) ACK in HS-mode Master Code Phase Received */
#define TWIM_SCR_HSMCACK            (0x1u << TWIM_SCR_HSMCACK_Pos)
#define TWIM_SCR_MASK               0x00027F08u  /**< \brief (TWIM_SCR) MASK Register */

/* -------- TWIM_PR : (TWIM Offset: 0x30) (R/  32) Parameter Register -------- */
#define TWIM_PR_OFFSET              0x30         /**< \brief (TWIM_PR offset) Parameter Register */
#define TWIM_PR_RESETVALUE          0x00000001   /**< \brief (TWIM_PR reset_value) Parameter Register */

#define TWIM_PR_HS_Pos              0            /**< \brief (TWIM_PR) HS-mode */
#define TWIM_PR_HS                  (0x1u << TWIM_PR_HS_Pos)
#define TWIM_PR_MASK                0x00000001u  /**< \brief (TWIM_PR) MASK Register */

